package classExam;

public class ArrayListEx {
    /*
    배열의 단점과 ArrayList
    1. 배열은 프로그램에서 사용하려면 항상 배열 길이를 정하고 시작한다.
    2. 예를 들어 100명의 학생을 위한 프로그램을 개발했는데, 어느 날 전학 온 학생으로
    100명이 넘게 되었다. 배열을 사용하는 중에는 길이를 변경할 수 없기 때문에 코드를 수정해야 한다.
    3. 혹은 중간에 학생 한 명이 전학을 갔다. 배열은 중간에 비어 있는 요소를 비워둘 수 없으므로
    배열 요소 위치를 변경해야 한다.
    4. 두 경우 모두 배열을 수정해야 하는 문제가 발생한다.
    -> 자바는 객체 배열을 좀 더 쉽게 사용할 수 있도록 객체 배열 클래스 ArrayList를 제공한다.

    ArrayList<E> 배열이름 = new ArrayList<E>(); E -> 클래스 (int는 되지 않고, Inteager은 사용이 가능함)
     */
}
